from __future__ import division, print_function
# coding=utf-8
import sys
import os
import glob
import re
import numpy as np

# Keras
from keras.applications.imagenet_utils import preprocess_input, decode_predictions
from keras.models import load_model
from keras.preprocessing import image

# Flask utils
from flask import Flask, redirect, url_for, request, render_template
from werkzeug.utils import secure_filename
#from gevent.pywsgi import WSGIServer

# Define a flask app
app = Flask(__name__)

# Model saved with Keras model.save()
MODEL_PATH = 'model.h5'

# Load your trained model
model = load_model(MODEL_PATH)
model._make_predict_function()          # Necessary

print('Model loaded. Check http://127.0.0.1:5000/')


black_rot=" Black ROT  ब्लॅक रॉट हा रोग ग्वाइनगार्डिया या बुरशीमुळे होतो.\
हा रोग ओल्या ,उबदार हंगामात सर्वाधिक पाहायला मिळतो . हा रोग झाडाच्या सर्व हिरव्या भागावर पसरतो. या रोगामुळे फळबाग नस्ट होते.\
\nब्लॅक रॉट ह्या रोगाची लक्षणे 2 आठवढ्यानंतर दिसून येतात.\
पानावर लहान गोलाकार ठिपके दिसून येतात. वेळीच उपचार केले नाही तर ठिपके दिवसेंदिवस  वाढत जातात .\
हा रोग फक्ट तरुण पानांवरच विकसित होऊ शकतो .वृध्द पानांवर नाही. \
सांस्कृतिक आणि रासायनिक नियंत्रण पद्धतींचे मिश्रण, द्राक्ष ब्लॅक रॉट रोगाचे व्यवस्थापन करू शकते. सांस्कृतिक नियंत्रण पैलूंमध्ये संसर्गजन्य उद्रेकानंतर वनस्पतींची निगा राखणे आणि \
क्षेत्रीय स्वच्छता तसेच मूलभूत गोष्टींमध्ये मूलभूत गोष्टी समाविष्ट असतात. रोगापासून बचाव करण्यासाठी पण रासायनिक नियंत्रणाचा बराच प्रभाव आहे.\
सांस्कृतिक नियंत्रण	\
सांस्कृतिक नियंत्रणामध्ये द्राक्ष पिके चांगल्या प्रकारे वाढविण्यासाठी शेतांचे व्यवस्थापन आणि स्वच्छता पद्धतींचा समावेश असतो.\
प्रथम सांस्कृतिक नियंत्रण पद्धत म्हणजे द्राक्ष पिकविल्या जाणाऱ्या भागासाठी योग्य द्राक्ष लागवडीची निवड करणे. काही जाती कमी संवेदनाक्षम असतात, तर योग्य वातावरणीय परिस्थिती\
 उद्भवल्यास इतरांना या रोगाचा धोका असतो.\
ब्लॅक रॉट रोगावर नियंत्रण ठेवण्यासाठी शेतातील द्राक्षांचे योग्य व्यवस्थापन आवश्यक आहे. योग्य वायुवीजन आणि प्रकाशयोजना प्रदान करण्यासाठी द्राक्ष वनस्पतींचे स्थान नियोजन महत्वाचे आहे.\
1] लागवडीसाठी साइट निवडा जेथे द्राक्षांचा वेल संपूर्ण सूर्यप्रकाश आणि चांगल्या हवेच्या अभिसरणात येईल.\
2] द्राक्षाच्या वेलाचे योग्य प्रशिक्षण घ्यावे. द्राक्षांचा वेल जमिनीवरुन ठेवण्यासाठी बरेच लोक ट्रेलींगचा वापर करतात. ट्रेलिझिंग हा वनस्पती प्रशिक्षण एक प्रकार आहे.\
जे उत्पादकता वाढविण्यासाठी वनस्पतींच्या भागांची व्यवस्था आहे.\
द्राक्ष द्राक्षांचा वेल जमिनीवर न ठेवल्यामुळे द्राक्षे आणि पावसापासून द्राक्षवेली ओल्या राहिल्या तर संक्रमणाचे प्रमाण मर्यादित होते.\
योग्य रोपांची छाटणी करण्याचे तंत्र म्हणजे रोगांना मर्यादित ठेवण्याची आणखी एक सांस्कृतिक नियंत्रण पद्धत. सुप्त काळात दरवर्षी प्रत्येक द्राक्षवेलीला छाटणी करावी.\
 द्राक्ष बागेतून जास्तीत जास्त वाढ, रोगट आणि जादा झाडे असलेली द्राक्ष, पाने आणि कोवळ्या काढून टाका आणि जाळून घ्या किंवा अन्यथा त्यांचा नाश करा. ही प्रथा बुरशीचे प्रभाव कमी करते,\
      त्यामुळे रोग मर्यादित होते. हंगामात चंदवाच्या वाढीस प्रशिक्षण देण्यासाठी किरकोळ रोपांची छाटणी वायुवीजन्यास मदत करण्यासाठी होऊ शकते.\
एकदा संसर्ग झाल्यावर स्वच्छ शेती राखणे ही शेवटची सांस्कृतिक नियंत्रण पद्धत आहे. शेतात व्यवस्थित व्यवस्थापित करा, द्राक्षे जवळ तण किंवा वनस्पती जास्त वाढू देऊ नका.\
रासायनिक नियंत्रणाचा वापर कृषी उद्देशाने मोठ्या प्रमाणात उपलब्ध आहे. रासायनिक अनुप्रयोग लागू करण्यासाठी, योग्य वापरासाठी बुरशीनाशक लेबल पहा.\
अर्ज केल्यामुळे बुरशीनाशकाची वाहून जाण्याची आणि अकार्यक्षमता टाळण्यासाठी फवारणीसाठी परिस्थिती अनुकूल असल्याचे सुनिश्चित करा.\
बुरशीनाशकाच्या मार्गदर्शक सूचनांचे अनुसरण केले पाहिजे. नियमित आणि सेंद्रिय उत्पादकांसाठी उपलब्ध अशी विविध प्रकारची रसायने आहेत.\
काळी रॉट नियंत्रित करण्यासाठी अमेरिकेच्या विशिष्ट प्रदेशांकरिता उत्कृष्ट असल्याचे दिसून येणारी सामान्य बुरशीनाशके म्हणजे सोव्ह्रान W० डब्ल्यूजी,\
 फ्लिंट W० डब्ल्यूजी, अबाऊंड फ्लोबल (०.०8 एफ) आणि प्रिस्टाईन W 38 डब्ल्यूडीजी. यापैकी काही बुरशीनाशके फक्त व्यावसायिक वापरासाठी उपलब्ध असू शकतात,\
तथापि घरमालक मालवेअर हार्डवेअर स्टोअर किंवा बुरशीनाशक वितरकावर जाऊ शकतात."

Grape___Esca="Esca(Black_Measles)--> एस्का हा परिपक्व द्राक्षांचा एक द्राक्ष रोग आहे. हा एक प्रकारचा द्राक्षाचा ट्रंक रोग आहे.\
द्राक्ष उत्पादक वेगवेगळ्या रोगांचा सामना करीत आहेत, त्यापैकी “ट्रंक रोग” देखील बहुतेकदा द्राक्षांचा अचानक मृत्यू होतो.\
     द्राक्षाचे अनेक ट्रंक रोग माहित आहेत, परंतु अलीकडे एस्का हा सर्वात विध्वंसक असल्याचे दिसते.\
         विद्यमान अभ्यासानुसार एस्का फॅओआक्रेमोनियम aलियोफिलम, फायोमोनिला क्लेमाइडोस्पोरा आणि फोमिटिपोरिया मेडिटेरानियासारख्या\
    वेगवेगळ्या बुरशीमुळे होतो. एस्काची लक्षणे 5 ते 7 किंवा 20 वर्षांच्या द्राक्षांच्या बागांमध्ये परिपक्व द्राक्षाच्या मशावर दिसू लागतात,\
        असे दिसते की गहन रोपांची छाटणी, दंव आणि इतर यांत्रिक जखम रोगाच्या वाढीस कारणीभूत ठरू शकतात.\
             जरी जुनी द्राक्ष बागांमध्ये एस्का दिसला तरीही द्राक्षांचा फटका एखाद्या नर्सरीमध्ये आधीच प्रभावित होऊ शकतो.\
                  एस्काची पहिली लक्षणे गडद लाल (लाल वाणांसाठी) किंवा पिवळ्या (पांढर्या वाणांवर) पानांवर पट्टे दिसतात,\
                       जी कालांतराने कोरडे होतात आणि नेक्रोटिक बनतात. जेव्हा हा रोग वाढतो तेव्हा\
                            संपूर्ण द्राक्षांचा नाश होतो. कधीकधी कोणतीही “चेतावणी” देखील\
                                 नसतात आणि अचानक द्राक्षाचा रस कोरडा होतो.\nलक्षणे\
\nप्रभावित पाने लहान असतात\
नसा दरम्यान क्लोरोटिक क्षेत्र,\
जे मोठे आणि कोरडे होते.\
लहान, गोल, गडद डाग\
तपकिरी-जांभळा किनारी\
बेरीवर रिंग्ज दिसू शकतात\
द्राक्षांचा वेल भाग मरतात\
अचानक, सहसा फार दरम्यान\
गरम कालावधी\
    अशी शंका आहे की लाकूड सडणारी बुरशी त्यामध्ये प्रवेश करते\
        मोठ्या रोपांची छाटणी जखमेवर रोपणे आणि सोडणे\
टॉक्सिनमुळे काळे गोवर. पानांची लक्षणे\
सहसा जुलै आणि ऑगस्टमध्ये फुलल्यानंतर दिसून येते.\
सध्या गोवरच्या दृष्टीने प्रभावी उपाय योजना नाहीत. छोट्या द्राक्ष बागांसह वाइन द्राक्ष उत्पादकांना बहुतेक वेळा पीक घेण्यापूर्वी फील्ड क्रूने संक्रमित फळ काढून टाकले पाहिजे.\
     गोवरमुळे बाधित मनुका कापणीच्या वेळी किंवा पॅकिंग हाऊसमध्ये टाकून दिला जाईल, तर टेबल द्राक्ष उत्पादक द्राक्षवेलीवर फळ देतील.\
         संशयित बुरशी ताज्या जखमांना वसाहतीत कमी करण्यासाठी कमीतकमी कमी करण्यासाठी वर्तमान संशोधनात बुरशीजन्य संक्रमणापासून रोपांची जखम रोखण्यावर लक्ष केंद्रित केले आहे.\
             खरोखर गोवर संक्रमित द्राक्षांचा वेलवर उपचार नाही. सोडियम आर्सेनाइट, एक मान्यताप्राप्त कार्सिनोजेनचे अनुप्रयोग काळ्या गोवर पसरण्यावर लक्ष ठेवतात असे दिसते, परंतु यापुढे त्याचा वापर स्वीकार्य नाही."


Leaf_blight="Leaf_blight  मायकोस्फेरेलेसी कुटूंबातील इसरीओपिस हा बुरशीचा एक प्रकार आहे. आयसॅरिओपसिस लीफ स्पॉट नावाचा वनस्पती रोग प्रत्यक्षात स्यूडोसरकोस्पोरा व्हिटिसमुळे होतो, ज्याला पूर्वी आय. व्हाइटिस म्हणून ओळखले जाते.\
पानाच्या पृष्ठभागावर आम्ही अनियमित आकाराचे (2 ते 25 मिमी व्यासाचे) जखमेचे दर्शन करू. सुरुवातीस जखम सुस्त लाल ते तपकिरी रंगात नंतर काळी घसरल्या जातात. जर रोग गंभीर असेल तर हे जखम एकत्र होऊ शकतात.\
     बेरीवर आपण काळ्या रॉटसारखेच लक्षण पाहू शकतो परंतु संपूर्ण क्लस्टर कोसळतात.\
पानाच्या पृष्ठभागावर अनियमित आकाराचे (2 ते 25 मिमी व्यासाचे) जखमेचे दर्शन करू. सुरुवातीस जखम सुस्त लाल ते तपकिरी रंगात नंतर काळी घसरल्या जातात.\
     जर रोग गंभीर असेल तर हे जखम एकत्र होऊ शकतात. बेरीवर आपण काळ्या रॉटसारखेच लक्षण पाहू शकतो परंतु संपूर्ण क्लस्टर कोसळतात.\
हा रोग पाने आणि फळांवर हल्ला करतो. पानाच्या फरकासह सर्वप्रथम लहान पिवळसर रंगाचे स्पॉट्स दिसतात,\
     जे हळूहळू वाढतात आणि एकाग्र रिंगसह तपकिरी रंगाचे ठिपके बनतात. तीव्र संसर्गामुळे पाने कोरडे होण्यास आणि कलंकित होण्यास कारणीभूत ठरतात.\
गडद तपकिरी-जांभळ्या रंगाचे ठिपके दिसू लागतात, त्यापासून फळांच्या लागवडीच्या अगदी थोड्या अंतरावर संक्रमित बेरी, रॅचिस आणि गुच्छांच्या देठावर दिसतात.\
फाकोपसोरा युव्हिटिसमध्ये 2 जीवन चक्र असतात आणि ते स्वत: चा प्रसार करण्यासाठी पुनरुत्पादन वापरू शकतात.\
रोगजनकांच्या मुक्त लावणी सामग्रीचा वापर करा; जर रोग अस्तित्वात असेल तर मृत आणि संक्रमित लाकूड बाहेर काढणे आणि मातीखाली नांगरट करणे; योग्य बुरशीनाशक लागू करा."



def model_predict(img_path, model):
    img = image.load_img(img_path, target_size=(64, 64))

    # Preprocessing the image
    x = image.img_to_array(img)
    x = x * 1./255
    x = np.expand_dims(x, axis=0)
    images = np.vstack([x])
    res = np.argmax(model.predict(images))
    return res


@app.route('/', methods=['GET'])
def index():
    # Main page
    return render_template('index.html')


@app.route('/predict', methods=['GET', 'POST'])
def upload():
    if request.method == 'POST':
        # Get the file from post request
        f = request.files['file']

        # Save the file to ./uploads
        basepath = os.path.dirname(__file__)
        file_path = os.path.join(
            basepath, 'uploads', secure_filename(f.filename))
        f.save(file_path)

        # Make prediction
        preds = model_predict(file_path, model)

   
        disease_list=['Grape___Black_rot', 'Grape___Esca_(Black_Measles)', 'Grape___Leaf_blight_(Isariopsis_Leaf_Spot)', 'Grape___healthy']   

        result = disease_list[int(preds)]
        if(result=="Grape___Black_rot"):
            message = black_rot
            return message
        if(result=="Grape___Esca_(Black_Measles)"):
            message = Grape___Esca
            return message
        if(result=="Grape___Leaf_blight_(Isariopsis_Leaf_Spot)"):
            message = Leaf_blight
            return message
        if(result=="Grape___healthy"):
            message = "Grape is Healthy"
            return message

      
        #return result
    return None



if __name__ == '__main__':
    app.run(threaded=False)
    #app.run(threaded=False)

